gg.alert("🆂🅲🆁🅸🅿🆃 🅱🆈 🅷🅴🅽🆁🆈 🆂 🐰🍫☠️ₜₑₛₜ ᵥᵢₚ ₚₑₐCₕY ₑᵥₑₙₜ ☠️🍫🐰ㅤㅤㅤㅤㅤ ㅤ🇼​🇪​🇱​🇨​🇴​🇲​🇪​ 🇹​🇴​ 🇭​🇪​🇳​🇷​🇾​ 🇸​ 🇲​🇴​🇩​ 🇸​🇨​🇷​🇮​🇵​🇹​ 🇭​🇦​🇨​🇰​ ══┈┈┈┄┄╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌╌┄┄┈┈┈┈┄┈┈┈┈┈┄┄╌╌╌╌══\n⊚ 🐰🍫☠️ʀᴇᴀᴅʏ-ᴛᴏ-ᴜꜱᴇ ꜱᴄʀɪᴘᴛ ꜱᴇʟᴇᴄᴛꜱ ᴄᴏɴᴠᴇɴɪᴇɴᴛ ᴏᴘᴛɪᴏɴꜱ ☠️🍫🐰Nᴇᴡ Sᴄʀɪᴘᴛ ᴠ1 1.69.x \n⊚ ☠️ʜᴇɴʀʏ ꜱ ꜱᴄʀɪᴘᴛ☠️\n══┈┈┈┄┄╌╌╌╌┄┄┈╌╌╌╌╌╌╌╌╌╌╌╌╌╌┈┈┈┄┈┈┈┈┈┄┄╌╌╌╌══")
while(true) do
if gg.isVisible(true) then
menuk = 1
gg.setVisible(false)
end

START = 1
-- garis (--) adalah komentar
-- tidak akan di exsekusi oleh script 
-- hanya untuk pengingat 
function START()
menu = gg.choice({"╭────────────────╮\n 📂 ₛcᵣᵢₚₜ ᵤₗₜᵣₐ ₘₒd ₘₑₙú ᴮʸ    ☠️ʜᴇɴʀʏ ꜱ ꜱᴄʀɪᴘᴛ☠️\n╰────────────────╯","ㅤㅤㅤㅤㅤㅤ╭───────────────────────────╮\nㅤㅤㅤㅤㅤㅤ ☞☠️━─━──── E⃢​    X⃢​    I⃢​    T⃢─────━─━☠️☞\nㅤㅤㅤㅤㅤㅤ╰───────────────────────────╯", "╭─────────────────────────────────────╮\n  🄸🄽🄵🄾 🄳🄴🄻 🄲🅁🄴🄰🄳🄾🅁==🄴🅂🅃🄴 🄷🄰🄲🄺 🄷🄰 🅂🄸🄳🄾 🄲🅁🄴🄰🄳🄾 🅈 🄼🄾🄳🄸🄵🄸🄲🄰🄳🄾 🄿🄾🅁 🄷🄴🄽🅁🅈 🅂. 🄻🄰 🄳🄸🅂🅃🅁🄸🄱🅄🄲🄸Ó🄽 🄳🄴🄻 🄷🄰🄲🄺 🅂🄸🄽 🄿🄰🄶🄰🅁 🄴🅂🅃🄰 🄿🅁🄾🄷🄸🄱🄸🄳🄰 🄴🄻 🄷🄰🄲🄺 🄴🅂 🅃🄾🅃🄰🄻🄼🄴🄽🅃🄴 🄳🄴 🄿🄰🄶🄰 🄴🄻 🄷🄰🄲🄺 🄲🅄🄴🄽🅃🄰 🄲🄾🄽 🄳🄴🅃🄴🄲🄲🄸Ó🄽 🄳🄴 🄲🄾🄽🄴🅇🄸🄾🄽🄴🅂 🅈 🄼🄾🄳🄸🄲🄰🄲🄸🄾🄽🄴🅂 🅂🄸 🅃🅁🄰🅃🄰🅂 🄳🄴 🅄🅂🄰🅁🄻🄾 🅂🄸🄽 🄰🅄🅃🄾🅁🄸🅉🄰🄲🄸Ó🄽 🅃🅄 🅂🅄🅂🄲🅁🄸🄿🄲🄸ó🄽 🅂🄴🅁á 🄴🄻🄸🄼🄸🄽🄰🄳🄰 🅈 🅃🄴🄽🄳🅁Á🅂 🅀🅄🄴 🄲🄾🄽🅃🄰🄲🅃🄰🅁 🄰🄻 🅂🄴🅁🅅🄴🅁 🄲🄷🄴🄰🅃🄴🅁 (https://t.me/HenrySOpaaiLover) 🄷🅂🅅 🄸🄽🅃🄴🅁🄿🅁🄸🄲🄴 🄰🄻🄻 🅁🄸🄶🄷🅃🅂 🅁🄴🅂🄴🅁🅅🄴🄳 🄵🄾🅁 🅃🄷🄸🅂 🅂🄲🅁🄸🄿🅃 ™ 2022                                                                          \n╰─────────────────────────────────────╯"} )
if menu == 1 then ch1() end
if menu == 2 then fin() end

menuk = -1
end


-- function ch1
function ch1()
menuch1 = gg.multiChoice({"╭───────────────────────────────────\n📂🐰🍫↬ₘₐₑₗₛₜᵣₒₘ↬v.l.a.d ☠️ʜᴇɴʀʏ ꜱ ꜱᴄʀɪᴘᴛ☠️\n╰───────────────────────────────────","╭───────────────────────────────────\n📂🐰🍫↬ₛₑᵥₑᵣₐₙcₑ ᵢₙ ₘₐₑₗₛₜᵣₒₘ☞☠️ʜᴇɴʀʏ ꜱ ꜱᴄʀɪᴘᴛ☠️\n╰───────────────────────────────────","╭───────────────────────────────────\n📂🐰🍫↬ₘₐₑₗₛₜᵣₒₘ₋ₛₚₑC☞↬☠️ʜᴇɴʀʏ ꜱ ꜱᴄʀɪᴘᴛ☠️\n╰───────────────────────────────────","╭───────────────────────────────────\n📂🔴↬ₑₛₚₑCᵢₐₗ₋ₗ.ₐ.ₖ ₕₐCₖ☞↬☠️ʜᴇɴʀʏ ꜱ ꜱᴄʀɪᴘᴛ☠️\n╰───────────────────────────────────","╭───────────────────────────────────\n📂🔴↬ₘₑₙᵤ DᵢₛCₒₙₑCCₜᵢₒₙ↬☠️ʜᴇɴʀʏ ꜱ ꜱᴄʀɪᴘᴛ☠️\n╰───────────────────────────────────","╭───────────────────────────────────\n📂🔴↬ₜₑᵣₘᵢₙₐₜₒᵣ☞ₘₐₑₗₛₜᵣₒₘ↬☠️ʜᴇɴʀʏ ꜱ ꜱᴄʀɪᴘᴛ☠️\n╰───────────────────────────────────","╭───────────────────────────────────\n📂🔴Gₒₗdₑₙ ᵥₒᵢD☞ₘₐₑₗₛₜᵣₒₘ↬☠️ʜᴇɴʀʏ ꜱ ꜱᴄʀɪᴘᴛ☠️\n╰───────────────────────────────────","╭───────────────────────────────────\n📂🔴ZₒₘBᵢₑ ᵥᵢₚ ₘₑₙᵤ ᵥ₁₁.₁ ₜₑₛₜ↬☠️ʜᴇɴʀʏ ꜱ ꜱᴄʀɪᴘᴛ☠️\n╰───────────────────────────────────","╭───────────────────────────────────\n📂🔴ᵢₘₚₛ ₛₙᵢₚₑᵣ ₘₑₙᵤ ᵥ₁₁.₁ ₜₑₛₜ↬☠️ʜᴇɴʀʏ ꜱ ꜱᴄʀɪᴘᴛ☠️\n╰───────────────────────────────────","╭───────────────────────────────────\n📂🔴ₙₒ Wₑₐₚₒₙ ₘₑₙᵤ ᵥ₁₁.₁ ₜₑₛₜ↬☠️ʜᴇɴʀʏ ꜱ ꜱᴄʀɪᴘᴛ☠️\n╰───────────────────────────────────","╭───────────────────────────────────\n📂☣ᴼ.ᴸ.ᴵ ᵂᴱᴬᴾᴼᴺ ₘₑₙᵤ ᵥ₁₁.₁ ₜₑₛₜ↬☠️ʜᴇɴʀʏ ꜱ ꜱᴄʀɪᴘᴛ☠️\n╰───────────────────────────────────","╭───────────────────────────────────\n📂 ☣DₒG ₕₐCₖ ₘₑₙᵤ ᵥ₁₁.2 ₜₑₛₜ↬☠️ʜᴇɴʀʏ ꜱ ꜱᴄʀɪᴘᴛ☠️\n╰───────────────────────────────────","╭───────────────────────────────────\n📂☣ᵥᵢₚ ₘₑₙᵤ ₕₐCₖ ᵥ₁.₅₅ ₜₑₛₜ↬☠️ʜᴇɴʀʏ ꜱ ꜱᴄʀɪᴘᴛ☠️\n╰───────────────────────────────────"},nil,"🇭​🇪​🇳​🇷​🇾​ 🇸​ 🇲​🇴​🇩​ 🇸​🇨​🇷​🇮​🇵​🇹​ 🇭​🇦​🇨​🇰​ㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤㅤ🐰🍫☠️ʀᴇᴀᴅʏ-ᴛᴏ-ᴜꜱᴇ ꜱᴄʀɪᴘᴛ ꜱᴇʟᴇᴄᴛꜱ ᴄᴏɴᴠᴇɴɪᴇɴᴛ ᴏᴘᴛɪᴏɴꜱ ultra millonary bug for peachy event☠️🍫🐰.")
if menuch1 == nil then else 
if menuch1[1] == true then Henry() end
if menuch1[2] == true then Henry2() end
if menuch1[3] == true then Henry3() end
if menuch1[4] == true then Henry4() end
if menuch1[5] == true then Henry5() end
if menuch1[6] == true then Henry6() end
if menuch1[7] == true then Henry7() end
if menuch1[8] == true then Henry8() end
if menuch1[9] == true then Henry9() end
if menuch1[10] == true then Henry10() end
if menuch1[11] == true then Henry11() end
if menuch1[12] == true then Henry12() end
if menuch1[13] == true then Henry13() end
end
end

function Henry()
TG = gg.makeRequest("https://raw.githubusercontent.com/HenrScriptsProLua1/Mc.lua/main/V.L.A.D.lua").content
if not TG then
os.exit()
else
pcall(load(TG))
end
end

function Henry2()
TG = gg.makeRequest("https://raw.githubusercontent.com/HenrScriptsProLua1/Mc.lua/main/Severance.lua").content
if not TG then
os.exit()
else
pcall(load(TG))
end
end

function Henry3()
TG = gg.makeRequest("https://raw.githubusercontent.com/HenrScriptsProLua1/Mc.lua/main/Spec.lua").content
if not TG then
os.exit()
else
pcall(load(TG))
end
end


function Henry4() 
TG = gg.makeRequest("https://raw.githubusercontent.com/HenrScriptsProLua1/Mc.lua/main/L.A.K.lua").content
if not TG then
os.exit()
else
pcall(load(TG))
end
end

--https://github.com/HenryyOp77hsv/HenryyOp77hsv/blob/main/MENUMOD.lua


function Henry5() 
TG = gg.makeRequest("https://raw.githubusercontent.com/HenrScriptsProLua1/Mc.lua/main/Desconexion.lua").content
if not TG then
os.exit()
else
pcall(load(TG))
end
end

function Henry6() 
TG = gg.makeRequest("https://raw.githubusercontent.com/HenrScriptsProLua1/Mc.lua/main/%F0%9F%86%83%F0%9F%85%B4%F0%9F%86%81%F0%9F%85%BC%F0%9F%85%B8%F0%9F%85%BD%F0%9F%85%B0%F0%9F%86%83%F0%9F%85%BE%F0%9F%86%81.lua").content
if not TG then
os.exit()
else
pcall(load(TG))
end
end


function Henry7() 
TG = gg.makeRequest("https://raw.githubusercontent.com/HenrScriptsProLua1/Mc.lua/main/%F0%9F%85%B6%F0%9F%85%BE%F0%9F%85%BB%F0%9F%85%B3%F0%9F%85%B4%F0%9F%85%BD%20%F0%9F%86%85%F0%9F%85%BE%F0%9F%85%B8%F0%9F%85%B3.lua").content
if not TG then
os.exit()
else
pcall(load(TG))
end
end


function Henry8() 
TG = gg.makeRequest("https://raw.githubusercontent.com/HenrScriptsProLua1/Mc.lua/main/Zombie%20fixed.lua").content
if not TG then
os.exit()
else
pcall(load(TG))
end
end



function Henry9() 
TG = gg.makeRequest("https://raw.githubusercontent.com/HenrScriptsProLua1/Mc.lua/main/IMPS%20IN%20MAELSTROM.lua").content
if not TG then
os.exit()
else
pcall(load(TG))
end
end


function Henry10() 
TG = gg.makeRequest("https://raw.githubusercontent.com/HenrScriptsProLua1/Mc.lua/main/%F0%9F%93%82%E2%82%99%E2%82%92W%E2%82%91%E2%82%90%E2%82%9A%E2%82%92%E2%82%99%E2%98%9E%E2%82%98%E2%82%90%E2%82%91%E2%82%97%E2%82%9B%E2%82%9C%E1%B5%A3%E2%82%92%E2%82%98%E2%98%A0%EF%B8%8F%CA%9C%E1%B4%87%C9%B4%CA%80%CA%8F%20%EA%9C%B1.lua").content
if not TG then
os.exit()
else
pcall(load(TG))
end
end


function Henry11() 
TG = gg.makeRequest("https://raw.githubusercontent.com/HenrScriptsProLua1/Mc.lua/main/%E2%98%A3%E1%B4%BC.%E1%B4%B8.%E1%B4%B5%20%E1%B5%82%E1%B4%B1%E1%B4%AC%E1%B4%BE%E1%B4%BC%E1%B4%BA.lua").content
if not TG then
os.exit()
else
pcall(load(TG))
end
end



function Henry12() 
TG = gg.makeRequest("https://raw.githubusercontent.com/HenrScriptsProLua1/Mc.lua/main/%E1%B4%B0%E1%B4%BC%E1%B4%B3%20%E1%B4%B4%E1%B4%AC%E1%B6%9C%E1%B4%B7.lua").content
if not TG then
os.exit()
else
pcall(load(TG))
end
end





function Henry13() 
TG = gg.makeRequest("https://raw.githubusercontent.com/HenrScriptsProLua1/Mc.lua/main/Menuop.lua").content
if not TG then
os.exit()
else
pcall(load(TG))
end
end








function fin()
gg.toast('MENU HACK MODERN COMBAT 5 by ђєภภy ร ๏P ђคcк')
print('       -----------------------MOD MENU Hack para MC5 -----------------------')                                                                               
print('Creador by:           ђєภภy ร ๏P ђคcк༺J꙰O꙰K꙰E꙰R꙰༻꧁༒☬GAMING☬༒꧂') 

print('Mi Facebook:    ђєภภy ร ๏P ђคcк') 

print('Mi discord:     รเи ∂เร¢๏я∂ קэя๏ мэ קµэ∂эร эи¢๏и†яลя эи †эℓэφяลм ¢๏м๏ ђ††קร://†.мэ/ђэияýร๏קลลเℓ๏√эя') 

print('nickname:     アђєภภy ร ๏P ђคcк༺J꙰O꙰K꙰E꙰R꙰༻꧁༒☬GAMING☬༒™')

print('ⓐⓟⓡⓞⓥⓔⓒⓗⓞ ⓟⓐⓡⓐ ⓜⓐⓝⓓⓐⓡ ⓢⓐⓛⓤⓓⓞⓢ ⓐ ⓣⓞⓓⓞⓢ ⓛⓞⓢ ⓟⓤⓣⓞⓢ ⓢⓘⓝ ⓜⓐⓝⓞⓢ ⓠⓤⓔ ⓤⓢⓐⓝ ⓗⓐⓒⓚ ⓔⓢⓣⓔ ⓗⓐⓒⓚ ⓔⓢ ⓒⓡⓔⓐⓓⓞ ⓨ ⓓⓘⓢⓣⓡⓘⓑⓤⓘⓓⓞ ⓟⓞⓡ ⓗⓔⓝⓡⓨ ⓞⓟ ⓒⓗⓔⓐⓣⓔⓡ ⓢⓘ ⓣⓘⓔⓝⓔⓢ ⓟⓡⓞⓑⓛⓔⓜⓐⓢ ⓒⓞⓝ ⓔⓛ ⓖⓤⓘóⓝ ⓨ/ⓞ ⓝⓔⓒⓔⓢⓘⓣⓐⓢ ⓜáⓢ ⓗⓐⓒⓚ ⓟⓤⓔⓓⓔⓢ ⓒⓞⓜⓤⓝⓘⓒⓐⓡⓣⓔ ⓒⓞⓝⓜⓘⓖⓞ ⓟⓞⓡ ⓣⓔⓛⓔⓖⓡⓐⓜ ⓗⓣⓣⓟⓢ://ⓣ.ⓜⓔ/ⓗⓔⓝⓡⓨⓢⓞⓟⓐⓐⓘⓛⓞⓥⓔⓡ ⓢⓐⓛⓤⓓⓞⓢ ⓨ ⓡⓘⓟ ⓜⓒ5 ⓐⓣⓣ ⓗⓢⓥ ⓗⓐⓒⓚⓢ :v') 
print("      ▄▀▄▀▄▀▄▀▄▀▄▀▄▀▄▀▄▀▄ ▀▄▀▄▀▄▀▄▀▄▀▄▀▄▀▄▀▄▀  ")
    print("══════════════⋆✪⋆══════════════╢")
    print(": ⠄⠄⠄⠄ ⠄⠄⠄⠄ ⠄⠄⠄⠄")
    print("⠄⠄⡔⠙⠢⡀⠄⠄⠄⢀⠼⠅⠈⢂⠄⠄⠄⠄")
    print("⠄⠄⡌⠄⢰⠉⢙⢗⣲⡖⡋⢐⡺⡄⠈⢆⠄⠄⠄")
    print("⠄⡜⠄⢀⠆⢠⣿⣿⣿⣿⢡⢣⢿⡱⡀⠈⠆⠄⠄")
    print("⠄⠧⠤⠂⠄⣼⢧⢻⣿⣿⣞⢸⣮⠳⣕⢤⡆⠄⠄")
    print("⢺⣿⣿⣶⣦⡇⡌⣰⣍⠚⢿⠄⢩⣧⠉⢷⡇⠄⠄")
    print("⠘⣿⣿⣯⡙⣧⢎⢨⣶⣶⣶⣶⢸⣼⡻⡎⡇⠄⠄")
    print("⠄⠘⣿⣿⣷⡀⠎⡮⡙⠶⠟⣫⣶⠛⠧⠁⠄⠄⠄")
    print(" ⠄⠄⠘⣿⣿⣿⣦⣤⡀⢿⣿⣿⣿⣄⠄⠄⠄⠄⠄")
    print("⠄⠄⠄⠈⢿⣿⣿⣿⣿⣷⣯⣿⣿⣷⣾⣿⣷⡄⠄")
    print("⠄⠄⠄⠄⠄⢻⠏⣼⣿⣿⣿⣿⡿⣿⣿⣏⢾⠇⠄")
    print("⠄⠄⠄⠄⠄⠈⡼⠿⠿⢿⣿⣦⡝⣿⣿⣿⠷⢀⠄")
    print("⠄⠄⠄⠄⠄⠄⡇⠄⠄⠄⠈⠻⠇⠿⠋⠄⠄⢘⡆")
    print("⠄⠄⠄⠄⠄⠄⠱⣀⠄⠄⠄⣀⢼⡀⠄⢀⣀⡜⠄")
    print("⠄⠄⠄⠄⠄⠄⠄⢸⣉⠉⠉⠄⢀⠈⠉⢏⠁⠄⠄")
    print("⠄⠄⠄⠄⠄⠄⡰⠃⠄⠄⠄⠄⢸⠄⠄⢸⣧⠄⠄")
    print("⠄⠄⠄⠄⠄⣼⣧⠄⠄⠄⠄⠄⣼⠄⠄⡘⣿⡆⠄")
    print("⠄⠄⠄⢀⣼⣿⡙⣷⡄⠄⠄⠄⠃⠄⢠⣿⢸⣿⡀")
    print("⠄⠄⢀⣾⣿⣿⣷⣝⠿⡀⠄⠄⠄⢀⡞⢍⣼⣿⠇")
    print("⠄⠄⣼⣿⣿⣿⣿⣿⣷⣄⠄⠄⠠⡊⠴⠋⠹⡜⠄")
    print("⠄⠄⣿⣿⣿⣿⣿⣿⣿⣿⡆⣤⣾⣿⣿⣧⠹⠄⠄")
    print("⠄⠄⢿⣿⣿⣿⣿⣿⣿⣿⢃⣿⣿⣿⣿⣿⡇⠄⠄")
    print("⠄⠄⠐⡏⠉⠉⠉⠉⠉⠄⢸⠛⠿⣿⣿⡟⠄")
    print("⠄⠄⠐★ʜᴇɴʀʏ ꜱ ꜱᴄʀɪᴘᴛ★⠄")
    
    
--★ʜᴇɴʀʏ ꜱ ꜱᴄʀɪᴘᴛ★
    print("╟══════════════⋆✪⋆══════════════╢")
    print("      ▄▀▄▀▄▀▄▀▄▀▄▀▄▀▄▀▄▀▄ ▀▄▀▄▀▄▀▄▀▄▀▄▀▄▀▄▀▄▀  \n \n")
os.exit()
main()
end

if menuk == 1 then START() end
end
